emacs/guides/dired.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dired</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">dired</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8de9f55">insert subdirectories</a></li>
<li><a href="#org1f5c777">find</a></li>
<li><a href="#org8befaeb">shell commands</a></li>
<li><a href="#org2c14876">replace text across multiple marked files</a></li>
<li><a href="#orgfb868f5">diff using a shell command</a></li>
<li><a href="#org14f9858">using dired diff</a></li>
<li><a href="#orgaa35f69">show the modification times of files</a></li>
<li><a href="#org33a69d3">open file using default application</a></li>
<li><a href="#org75d52cf">copy marked filenames</a></li>
</ul>
</div>
</div>


<div id="outline-container-org8de9f55" class="outline-2">
<h2 id="org8de9f55">insert subdirectories</h2>
<div class="outline-text-2" id="text-org8de9f55">
<ul class="org-ul">
<li>i     ; dired-maybe-insert-subdir</li>
<li>C-u k ; dired-do-kill-lines</li>
</ul>
</div>
</div>

<div id="outline-container-org1f5c777" class="outline-2">
<h2 id="org1f5c777">find</h2>
<div class="outline-text-2" id="text-org1f5c777">
<ul class="org-ul">
<li>find-name-dired</li>
<li>find-grep-dired</li>
</ul>
</div>
</div>

<div id="outline-container-org8befaeb" class="outline-2">
<h2 id="org8befaeb">shell commands</h2>
<div class="outline-text-2" id="text-org8befaeb">
<ul class="org-ul">
<li>! dired-do-shell-command</li>
<li>rsync -avt * ~/Desktop ; rsync marked files. locks emacs.</li>
</ul>
</div>
</div>

<div id="outline-container-org2c14876" class="outline-2">
<h2 id="org2c14876">replace text across multiple marked files</h2>
<div class="outline-text-2" id="text-org2c14876">
<ul class="org-ul">
<li>Q ; dired-do-find-regexp-and-replace</li>
<li>save in ibuffer using S</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb868f5" class="outline-2">
<h2 id="orgfb868f5">diff using a shell command</h2>
<div class="outline-text-2" id="text-orgfb868f5">
<ol class="org-ol">
<li>mark two files
<ul class="org-ul">
<li>can insert subdirectories</li>
</ul></li>
<li>! diff *</li>
</ol>
</div>
</div>

<div id="outline-container-org14f9858" class="outline-2">
<h2 id="org14f9858">using dired diff</h2>
<div class="outline-text-2" id="text-org14f9858">
<ol class="org-ol">
<li>the file where the cursor is is the first file</li>
<li>=</li>
<li>select a second file</li>
</ol>
</div>
</div>

<div id="outline-container-orgaa35f69" class="outline-2">
<h2 id="orgaa35f69">show the modification times of files</h2>
<div class="outline-text-2" id="text-orgaa35f69">
<pre class="example">
! ls -la --time-style=long-iso * ; all marked files
</pre>
</div>
</div>

<div id="outline-container-org33a69d3" class="outline-2">
<h2 id="org33a69d3">open file using default application</h2>
<div class="outline-text-2" id="text-org33a69d3">
<ul class="org-ul">
<li>W ; browse-url-of-dired-file</li>
</ul>
</div>
</div>

<div id="outline-container-org75d52cf" class="outline-2">
<h2 id="org75d52cf">copy marked filenames</h2>
<div class="outline-text-2" id="text-org75d52cf">
<ul class="org-ul">
<li>w ; dired-copy-filename-as-kill</li>
</ul>

<p>
<a href="../guides.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
